idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
/****************************************Copyright (c)****************************************************
 **                                  		 广州星海科技
 **                                  http://simhi.taobao.com
 **																		 TEL:15018750559
 **																			 QQ:86817447
 **------------------------File Info----------------------------------------------------------------------
 ** File Name:             GSM_App.c
 ** Last modified Date:   	2012.5.15
 ** Last Version:          V1.0
 ** Description:           GPS管理解析
 **
 **--------------------------------------------------------------------------------------------------------
 ** Created By:            Chenht
 ** Created date:          2012-5-3
 ** Version:               v1.0
 ** Descriptions:          The original version 初始版本
 **
 **--------------------------------------------------------------------------------------------------------
 ** Modified by:
 ** Modified date:
 ** Version:
 ** Description:
 **
 *********************************************************************************************************/
#include "at_sim800.h"
#include "string.h"
#include "stdio.h"
#include "stdlib.h"

#include "stm32gps_config.h"
#include "usart.h"
#include "GSM_App.h"

static char BackBuf[USART_GSM_BUFSIZE];
static char sendBuf[USART_GSM_BUFSIZE_SEND];
static char receiveBuf[USART_GSM_BUFSIZE_RECEIVE];

unsigned char GSMNetType;

/*********************************************************************************************************
 ** Function name:       strnchr()
 ** Descriptions:        查找字符串中第n个字符的位置
 ** input parameters:    S 需要查找的目标字符串
 **                      C 需要查找的字符
 **                      n 第几个位置的C
 ** output parameters:   需要查找的字符位置指针
 ** Returned value:
 *********************************************************************************************************/
char *strnchr(char *S, int C, int n)
{
    char *pnchr = NULL;
    char *pStr = S;

    if (n > strlen(S))
    {
        return NULL;
    }
    while (n--)
    {
        pnchr = strchr((const char *) pStr, C);
        if (NULL == pnchr)
        {
            break;
        }
        else
        {
            pStr = pnchr + 1;
        }
    }
    return pnchr;
}

/*********************************************************************************************************
 ** Function name:       strstr_len()
 ** Descriptions:        查找字符串中子字符串的位置，返回子字符串的位置
 ** input parameters:    str 需要查找的目标字符串
 **                      subStr 需要查找的子字符串
 **                      strlenth 目标字符串的长度
 ** output parameters:   
 ** Returned value:      子字符串的位置指针
 ** Example:  strstr_len("this,are,my,pointer", "my", 19) 返回的指针指向“m“的位置
 *********************************************************************************************************/
char *strstr_len(char *str, char *subStr, uint32_t strlenth)
{
    uint32_t subStrLen = strlen(subStr);
    int32_t cmpCnt = strlenth - strlen(subStr) + 1;

    char *retPtr = NULL;
    int32_t i;

    if (cmpCnt > 0)
    {
        for (i = 0; i < cmpCnt; i ++)
        {
            if (memcmp(str+i, subStr, subStrLen) == 0)
            {
                break;
            }
        }

        if (i < cmpCnt)
        {
            retPtr = str + i;
        }
    }

    return retPtr;
}

/*********************************************************************************************************
 ** Function name:       strnchr_len()
 ** Descriptions:        查找字符串中第几个字符值的位置，返回C的位置
 ** input parameters:    S 需要查找的目标字符串
 **                      C 需要查找的字符值
 **                      n 查找几个字符
 **                      len 目标字符串的长度
 ** output parameters:   
 ** Returned value:      C的位置指针
 ** Example: strnchr_len("this,are,my,pointer", ',', 2, 19); 返回指针指向are后面的','的位置
 *********************************************************************************************************/
char *strnchr_len(char *S, int C, uint32_t n, uint32_t len)
{
    char *pnchr = NULL;
    char *pStr = S;
    uint32_t i;

    if (n > len)
    {
        return NULL;
    }
    while (n--)
    {
        for (i = 0; i < len; i ++)
        {
            if (*(pStr+i) == C)
            {
                break;
            }
        }

        if (i < len)
        {
            pnchr = pStr+i;
            len -= i + 1;
        }
        else {
            pnchr = NULL;
        }

        if (NULL == pnchr)
        {
            break;
        }
        else
        {
            pStr = pnchr + 1;
        }
    }
    return pnchr;
}

/*********************************************************************************************************
 ** Function name:       strdig_len()
 ** Descriptions:        查找字符串中是否有n个数字，如果有则返回第一个数字位置的指针，如果没有则返回NULL。
 **                      字符串的长度必须大于需要查找的数字个数。
 ** input parameters:    str 需要查找的目标字符串
 **                      strlen 需要查找的字符串的长度
 **                      diglen 需要查找的数字的个数
 ** output parameters:   
 ** Returned value:      第一个数字的字符位置指针 or NULL
 *********************************************************************************************************/
char *strdig_len(char *str, uint32_t strlen, uint32_t diglen)
{

    char *retPtr = NULL;
    int32_t i;
	int32_t sumlen = 0;


    if (strlen > 0 && strlen > diglen)
    {
        for (i = 0; i < strlen; i ++)
        {
			if((*(str+i)>='0') && (*(str+i)<='9'))
			{
				sumlen++;
			}
			else
			{
				sumlen = 0;
			}
            if (sumlen >= diglen)
            {
				break;
            }
        }

        if (sumlen >= diglen)
        {
            retPtr = str + i - diglen +1;
        }
    }

    return retPtr;
}

/*********************************************************************************************************
 ** Function name:       strhex_len()
 ** Descriptions:        将十六进制字符串转换为十六进制数
 ** input parameters:    str 需要查找的目标字符串
 **                      len 目标字符串的长度
 ** output parameters:   
 ** Returned value:      转换后的十六进制数
 ** Example: 比如，字符串是"04"，转换后的值是0x04， 字符串是"2F"，转换后的值是0x2F
 *********************************************************************************************************/
uint32_t strhex_len(char *str, uint32_t len)
{
    uint32_t i;
	uint32_t sum = 0;
	uint32_t tmp = 0;
    for(i = 0; i < len; i++)
    {
	
	 if (str[i]>='A' && str[i] <='F')
	 {
		tmp = str[i]-55;//a-f之间的ascii与对应数值相差55如'A'为65,65-55即为A
	 }
	 else if(str[i]>='a' && str[i] <='f')
	 {
		tmp = str[i]-87;
	 }
	 else if(str[i]>='0' && str[i] <='9')
	 {
		tmp = str[i]-48;
	 }
		sum <<= 4;
		sum |= tmp;
	}

