idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
    return sum;
}

/*********************************************************************************************************
 ** Function name:       GSM_RingPinInit()
 ** Descriptions:        Ring状态检测IO初始化
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_RingPinInit(void)
{
#if 0
    GPIO_InitTypeDef GPIO_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource8);

    EXTI_InitStructure.EXTI_Line = EXTI_Line8;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
#endif
}

/*********************************************************************************************************
 ** Function name:       GSM_ChkRingSta()
 ** Descriptions:        检测Ring状态
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      Ring状态
 *********************************************************************************************************/
unsigned char GSM_ChkRingSta(void)
{
#if 0
    if (!GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_8))
    {
        return 1;
    }
#endif
    return 0;
}

/*********************************************************************************************************
 ** Function name:       GSM_PowerCtrlInit()
 ** Descriptions:        启动控制IO初始化
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_PowerCtrlInit(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
}

/*********************************************************************************************************
 ** Function name:       GSM_PowerOnOff()
 ** Descriptions:        启动或关闭模块
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_PowerOnOff(void)
{
    GPIO_ResetBits(GPIOC, GPIO_Pin_10);
    delay_ms(3000);
    GPIO_SetBits(GPIOC, GPIO_Pin_10);
    delay_ms(3000);
}

/*********************************************************************************************************
 ** Function name:       GSM_ClearBuffer()
 ** Descriptions:        清空接收缓存
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:
 *********************************************************************************************************/
void GSM_ClearBuffer(void)
{
    memset(BackBuf, 0, USART_GSM_BUFSIZE);
}
/*********************************************************************************************************
 ** Function name:       GSM_SendAT()
 ** Descriptions:        发送一条AT指令
 ** input parameters:    pCMD：指令指针
 **                      pCMDBack： 指令返回参考指针
 **                      CMDLen:  指令长度
 ** output parameters:   NONE
 ** Returned value:      发送指令返回状态
 *********************************************************************************************************/
#define DBG_GSM_SendAT
unsigned char GSM_SendAT(char *pCMD, char *pCMDBack, uint32_t CMDLen)
{
    unsigned char i = AT_RESEND_TIMES;
    unsigned int len;
    char *pBackBuf = BackBuf;
    unsigned char retFlag = 0;

    len = CMDLen;

#ifdef DBG_GSM_SendAT
    {
        uint32_t tmpIdx;

        if (len > 0)
        {
            printf("GSM_SendAT send\r\n");
            for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
            {
                //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                printf("%c",pCMD[tmpIdx]);
            }
            printf("\r\n");
            printf("GSM_SendAT done\r\n");
        }
    }
#endif

    usart_sendbuffer(STM32_SIM908_GSM_COM, pCMD, (unsigned int *) &len);

    if (NULL != pCMDBack)
    {
        while (--i)
        {
            len = USART_GSM_BUFSIZE;
            delay_ms(100);

            //printf("GSM_SendAT before usart_readbuffer len %d\n", len);

            retFlag = usart_readbuffer(STM32_SIM908_GSM_COM, pBackBuf, &len);
            //printf("GSM_SendAT after usart_readbuffer len %d\n", len);

#ifdef DBG_GSM_SendAT
            {
                uint32_t tmpIdx;

                if (len > 0 && retFlag == USART_ENPROCESS)
                {
                    printf("GSM_SendAT recv %d bytes\r\n", len);
                    for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
                    {
                        //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                        printf("%c",pBackBuf[tmpIdx]);
                    }
                    printf("\r\n");
					
                    printf("GSM_SendAT recv done\r\n");
                }
            }
#endif
            if (len > 0 && retFlag == USART_ENPROCESS)
            {
                if (NULL != strstr_len(pBackBuf, pCMDBack, len))
                {
                    break;
                }
            }
        }
		
        if (i == 0)
        {
            return USART_FAIL;
        }
    }
    return USART_SUCESS;
}

#define DBG_GSM_SendAT_buffer
unsigned char GSM_SendAT_rsp(char *pCMD, char *pCMDBack,
        uint32_t CMDLen, char **ppRecvBuf, uint32_t *pRecvLen)
{
    unsigned char i = 5;
    unsigned int len;
    char *pBackBuf = BackBuf;
    unsigned char retFlag = 0;

    len = CMDLen;

#ifdef DBG_GSM_SendAT_buffer
            {
                uint32_t tmpIdx;

                if (len > 0)
                {
                    printf("GSM_SendAT send\r\n");
                    for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
                    {
                        //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                        printf("%c",pCMD[tmpIdx]);
                    }
                    printf("\r\n");
                    printf("GSM_SendAT done\r\n");
                }
            }
#endif

    usart_sendbuffer(STM32_SIM908_GSM_COM, pCMD, (unsigned int *) &len);

