idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
    while (--i)
    {
        len = USART_GSM_BUFSIZE;
        delay_ms(100);

        //printf("GSM_SendAT before usart_readbuffer len %d\n", len);
        retFlag = usart_readbuffer(STM32_SIM908_GSM_COM, pBackBuf, &len);
        //printf("GSM_SendAT after usart_readbuffer len %d\n", len);

#ifdef DBG_GSM_SendAT_buffer
        {
            uint32_t tmpIdx;

            if (len > 0 && retFlag == USART_ENPROCESS)
            {
                printf("GSM_SendAT recv\r\n");
                for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
                {
                    //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                    printf("%c",pBackBuf[tmpIdx]);
                }
                printf("\r\n");
                printf("GSM_SendAT done\r\n");
            }
        }
#endif

        if (len > 0 && retFlag == USART_ENPROCESS)
        {
            if (ppRecvBuf != NULL)
            {
                *ppRecvBuf = pBackBuf;
            }

            if (pRecvLen != NULL)
            {
                *pRecvLen = len;
            }

            if (pCMDBack != NULL)
            {
                if (NULL
                        != strstr((const char *) pBackBuf,
                                  (const char *) pCMDBack))
                {
                    break;
                }
            }
            else {
                break;
            }
        }


        if (i == 0)
        {
            return USART_FAIL;
        }
    }
    return USART_SUCESS;
}
/*********************************************************************************************************
 ** Function name:       GSM_QueryNetType
 ** Descriptions:        查询运营商名称
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      运营商名称
 *********************************************************************************************************/
unsigned char GSM_QueryNetType(void)
{
    if (USART_SUCESS
            == GSM_SendAT((char *) AT_COPS, (char *) "MOBILE", sizeof(AT_COPS) - 1))
    {
        return CHINAMOBILE;
    }
    else if (USART_SUCESS
            == GSM_SendAT((char *) AT_COPS, (char *) "UNICOM", sizeof(AT_COPS) - 1))
    {
        return CHINAUNICOM;
    }
    else
    {
        return USART_FAIL;
    }
}
/*********************************************************************************************************
 ** Function name:       GSM_QuerySignal
 ** Descriptions:        查询信号强度
 ** input parameters:    NONE
 ** output parameters:   pSig: 信号强度
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_QuerySignal(unsigned char *pSig)
{
    unsigned int cmdLen;
    static char *pfeed = NULL;

    cmdLen = strlen(AT_CSQ);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) AT_CSQ, (char *) AT_OK, cmdLen))
    {
        pfeed = strnchr(BackBuf, ',', 1);
        if (pfeed == NULL)
            return USART_FAIL;
        pfeed -= 2;
        if (pfeed[0] < 0x30 || pfeed[0] > 0x39)
        {
            *pSig = pfeed[1] - 0x30;
        }
        else
        {
            *pSig = (pfeed[0] - 0x30) * 10 + (pfeed[1] - 0x30);
        }
        return USART_SUCESS;
    }
    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GSM_QueryImei
 ** Descriptions:        查询IMEI
 ** input parameters:    NONE
 ** output parameters:   pImei
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_QueryImei(uint8_t *pImei)
{
    unsigned int cmdLen;
    static char *pfeed = NULL;
	char *pRecvBuf = NULL;
    uint32_t recvLen = 0;

	cmdLen = strlen(AT_GSN_TEST);
	while (USART_SUCESS != GSM_SendAT((char *)AT_GSN_TEST, (char *)AT_OK, cmdLen));

    cmdLen = strlen(AT_GSN);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT_rsp((char *)AT_GSN, (char *)AT_OK, cmdLen, &pRecvBuf, &recvLen))
    {
		
        pfeed = strdig_len(pRecvBuf, recvLen, 15);
        if (pfeed == NULL)
        {
            return USART_FAIL;
        }
        
		if (pImei != NULL)
        {
            memcpy(pImei, pfeed, 15);
        }
		
        return USART_SUCESS;
    }
    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GSM_QueryImsi
 ** Descriptions:        查询IMSI
 ** input parameters:    NONE
 ** output parameters:   pImsiInfo
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_QueryImsi(pST_IMSIINFO pImsiInfo)
{
	uint32_t i;
    unsigned int cmdLen;
    static char *pfeed = NULL;
	char *pRecvBuf = NULL;
    uint32_t recvLen = 0;
	char tmpMcc[4];
	char tmpMnc[3];
	uint32_t tmpValue = 0;

    cmdLen = strlen(AT_CIMI);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT_rsp((char *)AT_CIMI, (char *)AT_OK, cmdLen, &pRecvBuf, &recvLen))
    {
		
        pfeed = strdig_len(pRecvBuf, recvLen, 15);
        if (pfeed == NULL)
        {
            return USART_FAIL;
        }

		for(i = 0; i < 3; i++)
		{
			tmpMcc[i] = *(pfeed+i);
		}
		tmpMcc[3] = '\0';

		for(i = 0; i < 2; i++)
		{
			tmpMnc[i] = *(pfeed+3+i);
		}
		tmpMnc[2] = '\0';

		tmpValue = atoi(tmpMcc);
		pImsiInfo->Mcc[0] = (tmpValue/255);
		if(tmpValue > 255)
		{
			pImsiInfo->Mcc[1] = (tmpValue%255 - 1);
		}
		else
		{
			pImsiInfo->Mcc[1] = (tmpValue%255);
		}

		tmpValue = atoi(tmpMnc);
		pImsiInfo->Mnc[0] = (tmpValue/255);
		if(tmpValue > 255)
		{
			pImsiInfo->Mnc[1] = (tmpValue%255 - 1);
		}
		else
		{
			pImsiInfo->Mnc[1] = (tmpValue%255);
		}
		
        return USART_SUCESS;
    }
    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GSM_QueryCREG
 ** Descriptions:        查询IMSI
 ** input parameters:    NONE
 ** output parameters:   pImsiInfo
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_QueryCreg(pST_CREGINFO pCregInfo)
{
	static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;
    char *pRecvBuf = NULL;
    uint32_t recvLen = 0;
    char *pStr = NULL;
	char tmpbuf[2];

