idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
    pcmdbuf = sendBuf;
    sprintf(pcmdbuf, AT_CREG_SET, 2);
    cmdLen = strlen(pcmdbuf);
    while (USART_SUCESS != GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen));

	cmdLen = strlen(AT_CREG);
	GSM_ClearBuffer();
    if(USART_SUCESS == GSM_SendAT_rsp((char *)AT_CREG, (char *) "CREG",
            							cmdLen, &pRecvBuf, &recvLen))
    {

		// lac
	    pStr = strnchr_len(pRecvBuf, '"', 1, recvLen);
		if(pStr == NULL)
		{
			return USART_FAIL;
		}
	    if (pStr != NULL)
	    {
	        tmpbuf[0] = *(pStr+1);
			tmpbuf[1] = *(pStr+2);
			pCregInfo->Lac[0] = strhex_len(tmpbuf, strlen(tmpbuf));
			tmpbuf[0] = *(pStr+3);
			tmpbuf[1] = *(pStr+4);
			pCregInfo->Lac[1] = strhex_len(tmpbuf, strlen(tmpbuf));
	    }

		// ci
	    pStr = strnchr_len(pRecvBuf, '"', 3, recvLen);
		if(pStr == NULL)
		{
			return USART_FAIL;
		}
	    if (pStr != NULL)
	    {
	        tmpbuf[0] = *(pStr+1);
			tmpbuf[1] = *(pStr+2);
			pCregInfo->Ci[0] = strhex_len(tmpbuf, strlen(tmpbuf));
			tmpbuf[0] = *(pStr+3);
			tmpbuf[1] = *(pStr+4);
			pCregInfo->Ci[1] = strhex_len(tmpbuf, strlen(tmpbuf));
	    }

		// stat
	    pStr = strnchr_len(pRecvBuf, ',', 2, recvLen);
		if(pStr == NULL)
		{
			return USART_FAIL;
		}
	    if (pStr != NULL)
	    {
			pCregInfo->Stat = *(pStr-1);
	    }

		// n
	    pStr = strnchr_len(pRecvBuf, ',', 1, recvLen);
		if(pStr == NULL)
		{
			return USART_FAIL;
		}
	    if (pStr != NULL)
	    {
			pCregInfo->n = *(pStr-1);
    	}

		return USART_SUCESS;
    }

    return USART_FAIL;
}

/*********************************************************************************************************
 ** Function name:       GSM_SendSMS
 ** Descriptions:        发送一条短信
 ** input parameters:    pNumb: 接收短信的号码指针
 **											pSMS: 短信内容
 **											type: 短信发送格式 1-TEXT 0-PUD
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_SendSMS(char *pNumb, char *pSMS, unsigned char type)
{
    static char *pcmdbuf = NULL;
    static char smsBuffer[128];
    static char numbBuffer[15];
    static char smsLen[2];
    unsigned int cmdLen = 0;
    unsigned char i, j;

    GSM_ClearBuffer();
    pcmdbuf = sendBuf;
    if (pcmdbuf == NULL)
    {
        return USART_FAIL;
    }
    sprintf(pcmdbuf, AT_CMGF, type);
    cmdLen = strlen(pcmdbuf);
    GSM_SendAT(pcmdbuf, (char *) AT_OK, cmdLen);	 //设置短信模式

    if (1 == type)	//TEXT模式
    {
        strcpy(smsBuffer, pSMS);								//拷贝需要发送的短信内容
        GSM_ClearBuffer();
        pcmdbuf = sendBuf;
        if (pcmdbuf == NULL)
        {
            return USART_FAIL;
        }
        sprintf(pcmdbuf, AT_CMGS, pNumb);
        cmdLen = strlen(pcmdbuf);
        GSM_SendAT(pcmdbuf, ">", cmdLen);					  //设置目标号码

        delay_ms(500);
        strcat(smsBuffer, "\x1A");					 				//添加结束符号0x1A
        cmdLen = strlen(smsBuffer);
        GSM_ClearBuffer();
        usart_sendbuffer(STM32_SIM908_GSM_COM, smsBuffer,
                (unsigned int *) &cmdLen);
        delay_ms(2000);
        cmdLen = USART_GSM_BUFSIZE;
        usart_sendbuffer(STM32_SIM908_GSM_COM, BackBuf,
                (unsigned int*) &cmdLen);
        if (NULL != strstr((const char *) BackBuf, "OK"))
        {
            return USART_SUCESS;
        }
    }
    else if (0 == type)
    {
        i = 0;
        j = 0;
        do
        {
            numbBuffer[i++] = pNumb[j + 1];
            numbBuffer[i++] = pNumb[j];
            j = j + 2;
            if (pNumb[j + 1] == 0x0d || pNumb[j + 1] == 0)
            {
                numbBuffer[i++] = 'F';
                numbBuffer[i++] = pNumb[j];
                break;
            }
        } while (j < 11);
        strcpy(smsBuffer, "0011000D9168");
        strcat(smsBuffer, (const char *) &numbBuffer);
        strcat(smsBuffer, "0008A0");
        cmdLen = strlen(pSMS) / 2;
        sprintf(smsLen, "%X%X", cmdLen / 16, cmdLen % 16);
        strcat(smsBuffer, smsLen);
        strcat(smsBuffer, pSMS);

        GSM_ClearBuffer();
        pcmdbuf = sendBuf;
        if (pcmdbuf == NULL)
        {
            return USART_FAIL;
        }
        cmdLen = strlen(smsBuffer) / 2 - 1;
        sprintf(pcmdbuf, AT_CMGSPDU, cmdLen);
        cmdLen = strlen(pcmdbuf);
        GSM_SendAT(pcmdbuf, ">", cmdLen);					  //设置目标号码

        delay_ms(500);

        strcat(smsBuffer, "\x1A");
        cmdLen = strlen(smsBuffer);
        GSM_ClearBuffer();
        usart_sendbuffer(STM32_SIM908_GSM_COM, smsBuffer,
                (unsigned int *) &cmdLen);
        delay_ms(2000);
        cmdLen = USART_GSM_BUFSIZE;
        usart_sendbuffer(STM32_SIM908_GSM_COM, BackBuf,
                (unsigned int*) &cmdLen);
        if (NULL != strstr((const char *) BackBuf, "OK"))
        {
            return USART_SUCESS;
        }
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_Init
 ** Descriptions:        GSM初始化
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      NONE
 *********************************************************************************************************/
void GSM_simcard_Init(void)
{
    uint32_t i;
    uint32_t len;

    //查询卡状态
    i = 0;
    len = strlen(AT_CPIN);
    while (USART_SUCESS != GSM_SendAT((char *) AT_CPIN, (char *) "READY", len))
    {
        delay_ms(100);
        i++;
#if 0
        if (i > 2)
        {
            break;
        }
#endif
    }
    i = 0;
    GSMNetType = USART_FAIL;
    //查询网络运营商
    while (USART_FAIL == GSMNetType)
    {
        GSMNetType = GSM_QueryNetType();
#if 0
        if (i++ > 5)
            break;
#endif
    }
	
}

void GPS_Init(void)
{
    uint32_t len;

    //打开GPS
    //可根据需要设置GPS输出数据选择 如AT+CGPSOUT=67
    len = sizeof(AT_CGPSPWR);
    while (USART_SUCESS != GSM_SendAT((char *) AT_CGPSPWR, (char *) "OK", len));
    len = sizeof(AT_CGPSRST);
    while (USART_SUCESS != GSM_SendAT((char *) AT_CGPSRST, (char *) "OK", len));
}

