idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
            if (len > 0 && retFlag == USART_ENPROCESS)
            {
                printf("GPRS_ReceiveData recv\r\n");
                for (tmpIdx = 0; tmpIdx < len; tmpIdx ++)
                {
                    //printf("%d-%c\r\n", tmpIdx, pBackBuf[tmpIdx]);
                    printf("%c",receiveBuf[tmpIdx]);
					
                }
                printf("\r\n");
                printf("GPRS_ReceiveData done\r\n");
            }
        }
		printf("%d retFlag = %d len = %d\n\n", i, retFlag, len);

		if (len > 0 && retFlag == USART_ENPROCESS)
        {
            if (NULL != strstr_len(pReceiveBuf, pString, len))
            {
				printf("Receive New Message.\n");
                break;
            }
        }
        
#endif
    }

    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GPRS_CheckLinkStatus
 ** Descriptions:      	查询GPRS链接状态
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回GPRS链接状态结果
 *********************************************************************************************************/
unsigned char GPRS_CheckLinkStatus(void)
{
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GPRS_CLoseLink
 ** Descriptions:      	关闭GPRS链接
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GPRS_CloseLink(void)
{
    unsigned int cmdLen;

    cmdLen = strlen(AT_CIPCLOSE);
    if (USART_SUCESS
            == GSM_SendAT((char *) AT_CIPCLOSE, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GPRS_CIPShut
 ** Descriptions:      	退出GPRS链接
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GPRS_CIPShut(void)
{
    unsigned int cmdLen;

    cmdLen = strlen(AT_CIPSHUT);
    if (USART_SUCESS
            == GSM_SendAT((char *) AT_CIPSHUT, (char *) AT_OK, cmdLen))
    {
        return USART_SUCESS;
    }
    return USART_FAIL;
}
/*********************************************************************************************************
 ** Function name:       GSM_QueryBattery
 ** Descriptions:      	查询电池状态
 ** input parameters:    NONE
 ** output parameters:   NONE
 ** Returned value:      返回状态结果
 *********************************************************************************************************/
unsigned char GSM_QueryBattery(pST_BATTERYSTATUS pSig)
{
    unsigned int cmdLen;
    static char *pfeed = NULL;

    cmdLen = strlen(AT_CBC);
    GSM_ClearBuffer();
    if (USART_SUCESS == GSM_SendAT((char *) AT_CBC, (char *) AT_OK, cmdLen))
    {
        pfeed = strnchr(BackBuf, ',', 1);	//提取充电状态
        if (pfeed == NULL)
        {
            return USART_FAIL;
        }
        pfeed -= 1;
        pSig->BatStatus = pfeed[0];

        pfeed = strnchr(BackBuf, ',', 2);	//提取电池电量信息
        if (pfeed == NULL)
        {
            return USART_FAIL;
        }
		
		pSig->BatVoltage.i= (pfeed[1] - 0x30)*1000 + (pfeed[2] - 0x30)*100 + (pfeed[3] - 0x30)*10 + (pfeed[4] - 0x30);
		
        pfeed -= 3;
        if (pfeed[0] >= 0x30 && pfeed[0] <= 0x39)
        {
            pSig->BatPower = (pfeed[0] - 0x30) * 100 + (pfeed[1] - 0x30) * 10
                    + (pfeed[2] - 0x30);
        }
        else
        {
            pSig->BatPower = (pfeed[1] - 0x30) * 10 + (pfeed[2] - 0x30);
        }

		
        return USART_SUCESS;
    }
    return USART_FAIL;
}

unsigned char GSM_creg(void)
{
    static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;
    char *pRecvBuf = NULL;
    uint32_t recvLen = 0;

    char *pStr;

    pcmdbuf = sendBuf;
    sprintf(pcmdbuf, AT_CREG_SET, 2);
    cmdLen = strlen(pcmdbuf);
    while (USART_SUCESS != GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen));

    while (1)
    {
        while (USART_SUCESS != GSM_SendAT_rsp((char *)AT_CREG, (char *) "CREG",
                sizeof(AT_CREG), &pRecvBuf, &recvLen));

        pStr = strnchr_len(pRecvBuf, ':', 1, recvLen);
        if (pStr != NULL)
        {
            do {
                pStr ++;
            } while (*pStr == ' ');

            if (*pStr == '2')
            {
                break;
            }
        }
    }

    // analyze AT_CREG rsp


    return USART_SUCESS;
}

unsigned char GSM_cgatt(void)
{
    char *pRecvBuf = NULL;
    uint32_t recvLen = 0;

    char *pStr;

    while (1)
    {
        while (USART_SUCESS != GSM_SendAT_rsp((char *) AT_CGATT, (char *) "CGATT",
                sizeof(AT_CGATT), &pRecvBuf, &recvLen));

        // analyze CGATT rsp
        pStr = strnchr_len(pRecvBuf, ':', 1, recvLen);
        if (pStr != NULL)
        {
            do {
                pStr ++;
            } while (*pStr == ' ');

            if (*pStr == '1')
            {
                break;
            }
        }
    }

    return USART_SUCESS;
}

unsigned char GSM_cstt(void)
{
    static char *pcmdbuf = NULL;
    unsigned int cmdLen = 0;

    pcmdbuf = sendBuf;
    sprintf(pcmdbuf, AT_CSTT_SET, "\"CMNET\"");
    cmdLen = strlen(pcmdbuf);
    while (USART_SUCESS != GSM_SendAT((char *) pcmdbuf, (char *) AT_OK, cmdLen));

    return USART_SUCESS;
}

unsigned char GSM_ciicr(void)
{
    while (USART_SUCESS != GSM_SendAT((char *) AT_CIICR, (char *) AT_OK, sizeof(AT_CIICR)));

    return USART_SUCESS;
}

unsigned char GSM_cifsr(void)
{
    char *pRecvBuf = NULL;
    uint32_t recvLen = 0;

    while (USART_SUCESS != GSM_SendAT_rsp((char *) AT_CIFSR, NULL,
            sizeof(AT_CIFSR), &pRecvBuf, &recvLen));

