idaohang/stm32gps/Utilities/SIM800L/GSM_App.c
    // analyze CGATT rsp


    return USART_SUCESS;
}

unsigned char GSM_cgpsstatus(void)
{
    //char *pRecvBuf = NULL;

    while (USART_SUCESS != GSM_SendAT((char *) AT_CGPSSTATUS,
            (char *) NULL/*AT_OK*/, sizeof(AT_CGPSSTATUS)));

    // analyze CGATT rsp


    return USART_SUCESS;
}

void GPRS_Init_Interface(void)
{
    unsigned int cmdLen;
	ST_NETWORKCONFIG stNetCfg;

    sprintf(stNetCfg.TransferMode, "%s", "TCP");
    sprintf(stNetCfg.RemoteIP, "%s", "121.40.200.84");
    sprintf(stNetCfg.RemotePort, "6666");

	cmdLen = strlen(AT_CIPMODE_0);
    GSM_SendAT((char *) AT_CIPMODE_0, (char *) AT_OK, cmdLen);
	GSM_cgatt();
    GSM_cstt();
    GSM_ciicr();
    GSM_cifsr();
    while (USART_SUCESS != GPRS_LinkServer(&stNetCfg));
}

char str[30] = "123456789012345678901234567890";
void GSM_str_test(void)
{
    char *retPtr;

    retPtr = strstr_len(str, "2", 1);
    printf("GSM_str_test %d, %d, %d\n", retPtr-str, retPtr, str);
    retPtr = strstr_len(str, "2", 30);
    printf("GSM_str_test %d\n", retPtr-str);
    retPtr = strstr_len(str, "23456", 30);
    printf("GSM_str_test %d\n", retPtr-str);
    retPtr = strstr_len(str, str, 30);
    printf("GSM_str_test %d\n", retPtr-str);


    retPtr = strnchr_len(str, '1', 1, 30);
    printf("GSM_str_test %d\n", retPtr-str);
    retPtr = strnchr_len(str, '1', 2, 30);
    printf("GSM_str_test %d\n", retPtr-str);
    retPtr = strnchr_len(str, '1', 3, 30);
    printf("GSM_str_test %d\n", retPtr-str);
    retPtr = strnchr_len(str, '1', 4, 30);
    printf("GSM_str_test %d\n", retPtr-str);
}

s8 Test_TelNumber[12]="15306568880\0";
void GSM_test_once(void)
{
	unsigned int cmdLen;
	char str[24];
    ST_NETWORKCONFIG stNetCfg;
//[67 67 01  00 0C 00 01 01 23  45 67 89 01 23 45 00 20]
	str[0] = 0x67;
	str[1] = 0x67;
	str[2] = 0x01;
	str[3] = 0x00;
	str[4] = 0x0C;
	str[5] = 0x00;
	str[6] = 0x01;
	str[7] = 0x01;
	str[8] = 0x23;
	str[9] = 0x45;
	str[10] = 0x67;
	str[11] = 0x89;
	str[12] = 0x01;
	str[13] = 0x23;
	str[14] = 0x45;
	str[15] = 0x00;
	str[16] = 0x20;

	  sprintf(stNetCfg.TransferMode, "%s", "TCP");
    sprintf(stNetCfg.RemoteIP, "%s", "121.40.200.84");
    sprintf(stNetCfg.RemotePort, "6666");
    //while (USART_SUCESS != GSM_CallNumber((char*)Test_TelNumber));

	cmdLen = strlen(AT_CIPMODE_0);
    GSM_SendAT((char *) AT_CIPMODE_0, (char *) AT_OK, cmdLen);
	
    GSM_creg();
    GSM_cgatt();
    GSM_cstt();
    GSM_ciicr();
    GSM_cifsr();

#if 1
    while (USART_SUCESS != GPRS_LinkServer(&stNetCfg));

	while(1)
	{
    	if(USART_FAIL == GPRS_SendData(str, 17))
    	{
			printf("GPRS_SendData Fail\n");
    	}
		delay_ms(10000);
	}
#endif
}

#define DBG_GSM_DATA
void GetGsmData(pST_SIMDATA pSimData)
{
	uint32_t i;
	ST_IMSIINFO imsi;
	ST_CREGINFO creg;
	ST_BATTERYSTATUS battery;
	unsigned char signal = 0;

	while(USART_SUCESS != GSM_QueryImsi(&imsi));
	while(USART_SUCESS != GSM_QueryCreg(&creg));
	while(USART_SUCESS != GSM_QueryBattery(&battery));
	while(USART_SUCESS != GSM_QuerySignal(&signal));

	pSimData->Station[0] = imsi.Mcc[0];
	pSimData->Station[1] = imsi.Mcc[1];
	pSimData->Station[2] = imsi.Mnc[0];
	pSimData->Station[3] = imsi.Mnc[1];
	pSimData->Station[4] = creg.Lac[0];
	pSimData->Station[5] = creg.Lac[1];
	pSimData->Station[6] = 0x00;  // 补零
	pSimData->Station[7] = creg.Ci[0];
	pSimData->Station[8] = creg.Ci[1];

	pSimData->Battery[0] = battery.BatVoltage.s[1];
	pSimData->Battery[1] = battery.BatVoltage.s[0];

	sprintf(pSimData->Signal, "%x", signal);

#ifdef DBG_GSM_DATA
printf("STATION:");
for(i = 0; i < 9; i++)
{
	printf("0x%x-", pSimData->Station[i]);
}
printf("\n");
printf("BATTERY:");
for(i = 0; i < 2; i++)
{
	printf("0x%x-", pSimData->Battery[i]);
}
printf("\n");
printf("SIGNAL:");
for(i = 0; i < 2; i++)
{
	printf("0x%x-", pSimData->Signal[i]);
}
printf("\n");
#endif
}

void GSM_test(void)
{
	int i;
	uint8_t signal = 0;
    //GSM_cgpsstatus();
    uint8_t imeibuf[IMEI_BUFSIZE];
	ST_BATTERYSTATUS battery;
	ST_IMSIINFO imsi;
	ST_CREGINFO creg;
	//unsigned int cmdLen;
    while(USART_SUCESS != GSM_QueryImei(imeibuf));
	
	for(i = 0; i < 15; i++)
	{
		printf("0x%x - %c;", imeibuf[i],imeibuf[i]);
	}
	printf("\n");
	
	while(USART_SUCESS != GSM_QuerySignal(&signal));
	printf("signal = %d\n", signal);

	while(USART_SUCESS != GSM_QueryBattery(&battery));
	printf("power = %d;status=%d voltage[0]=0x%x [1] = 0x%x\n", battery.BatPower,battery.BatStatus, battery.BatVoltage.s[0], battery.BatVoltage.s[1]);

// cimi
	
	while (USART_SUCESS != GSM_QueryImsi(&imsi));
	printf("mcc[0] = 0x%x, mcc[1] = 0x%x; mnc[0]=0x%x,mnc[1]=0x%x\n", imsi.Mcc[0],imsi.Mcc[1],imsi.Mnc[0],imsi.Mnc[1]);


	while(USART_SUCESS != GSM_QueryCreg(&creg));
	printf("n = %d; status=%d lac[0] = 0x%x, lac[1] = 0x%x ci[0] = 0x%x ci[1] = 0x%x\n", creg.n, creg.Stat, creg.Lac[0], creg.Lac[1], creg.Ci[0], creg.Ci[1]);
    //GSM_creg();
	//GSM_cgatt();
    //GSM_cstt();
    //GSM_ciicr();
    //GSM_cifsr();
}

void GSM_tcpip_test(void)
{

}

